{
    "error": {
        "path": "Error fallback",
        "text": {
            "visual": {
                "size12": [
                    "I'M SORRY!",
                    "ㅤ",
                    "You might have encountered an error in the game.",
                    "This is not part of the story.",
                    "ㅤ",
                    "Please click the GAME button or any other button in the Navigation above to go back to the start."
                ],
                "size16": [
                    "I'M SORRY!",
                    "ㅤ",
                    "You might have encountered an error in the game.",
                    "This is not part of the story.",
                    "ㅤ",
                    "Please click the GAME button or any other button in the Navigation above to go back to the start."
                ],
                "size20": [
                    "I'M SORRY!",
                    "ㅤ",
                    "You might have encountered an error in the game.",
                    "This is not part of the story.",
                    "ㅤ",
                    "Please click the GAME button or any other button in the Navigation above to go back to the start."
                ],
                "darkmode": [
                    "I'M SORRY!",
                    "ㅤ",
                    "You might have encountered an error in the game.",
                    "This is not part of the story.",
                    "ㅤ",
                    "Please click the GAME button or any other button in the Navigation above to go back to the start."
                ],
                "japanese": []
            },
            "screenreader": "Error. Please follow the text instructions!",
            "alt": "Error. Please follow the text insturctions"
        },
        "choices": {
            "first": {
                "screenreader": "This button will lead you to the start of the game again!",
                "alt": "This button will lead you to the start of the game again!",
                "routeToID": "0"
            },
            "second": {
                "screenreader": "This button will lead you to the start of the game again!",
                "alt": "This button will lead you to the start of the game again!",
                "routeToID": "0"
            },
            "third": {
                "screenreader": "This button will lead you to the start of the game again!",
                "alt": "This button will lead you to the start of the game again!",
                "routeToID": "0"
            }
        }
    },
    "0": {
        "path": "The Beginning",
        "text": {
            "visual": {
                "size12": [
                    "",
                    ""
                ],
                "size16": [
                    "You've been waiting for your partner's reply for three days. Concerned, you decide to visit his flat.",
                    "Upon entering, a deep silence greets you. Your partner sits motionless in his Netrunning chair, a network of monitors around him. A white cat on his lap meets your gaze, then vanishes behind the chair. The monitors flash red with a name written in the middle:",
                    "伶",
                    "It dawns on you: your partner has been hacked during Netrunning, a process where one's consciousness navigates the digital realm, leaving their physical body unresponsive and vulnerable. He's now trapped, unable to control his own body, lingering between the digital and physical world.",
                    "The mysterious disappearance of the cat lingers in your thoughts, a nagging suspicion that it's somehow entwined with your partner's predicament and you realize it's up to you to dive into the net and track down this elusive hacker.",
                    "ㅤ",
                    "As you take a dive into the net you spot three traces that are signed by the mysterious name. You are not sure which trace you should follow first and what to expect exactly:",
                    "Choice 1: You follow a trace that leads to Jig-Jig Street.",
                    "Choice 2: You follow a trace that leads to the Bazarr in Japan town.",
                    "Choice 3: You follow a trace to a Megabuilding nearby.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [
                    "",
                    ""
                ],
                "darkmode": [
                    ""
                ],
                "japanese": []
            },
            "screenreader": "Das ist deutsch. You've been waiting for your partner's reply for three days. Concerned, you decide to visit his flat. Upon entering, a deep silence greets you. Your partner sits motionless in his Netrunning chair, a network of monitors around him. A white cat on his lap meets your gaze, then vanishes behind the chair. The monitors flash red with a name written in the middle: '伶.'It dawns on you: your partner has been hacked during Netrunning, a process where one's consciousness navigates the digital realm, leaving their physical body unresponsive and vulnerable. He's now trapped, unable to control his own body, lingering between the digital and physical world. The mysterious disappearance of the cat lingers in your thoughts, a nagging suspicion that it's somehow entwined with your partner's predicament, and you realize it's up to you to dive into the net and track down this elusive hacker.As you take a dive into the net, you spot three traces that are signed by the mysterious name. You are not sure which trace you should follow first and what to expect exactly:",
            "alt": "Missing Text!"
        },
        "choices": {
            "first": {
                "visual": "",
                "screenreader": "Hear about option 1",
                "alt": "Jig-Jig Street? \nOdd place for a hacker.",
                "routeToID": "01"
            },
            "second": {
                "visual": "",
                "screenreader": "Hear about option 2",
                "alt": "Japantown Bazarr? \nYou partner Mentioned this place several times.",
                "routeToID": "02"
            },
            "third": {
                "visual": "",
                "screenreader": "Hear about option 3",
                "alt": "A Megabuilding seems like a good place to hide something.",
                "routeToID": "03"
            }
        }
    },
    "01": {
        "path": "Jig-Jig Street.",
        "text": {
            "visual": {
                "size12": [
                    "As you track the signal originating from Jig-Jig Street, it leads you to an unexpected discovery: ",
                    "A doorbell, cleverly hacked. Now, every time the doorbell is activated through the net, it emits three distinct meows instead of its usual chime.",
                    "The residence belongs to Mrs. 佐藤. It seems an odd target for such a peculiar hack.",
                    "ㅤ",
                    "Faced with this quirky situation, you ponder your next move:",
                    "Choice 1: This doesn't seem like a promising lead. Better to try your luck elsewhere.",
                    "Choice 2: Curiosity gets the better of you. Why not ring the bell and see what unfolds?",
                    "Choice 3: Decide to undo the hack on the doorbell, restoring it to normal, and then move on to explore another trace."
                ],
                "size16": [
                    "As you track the signal originating from Jig-Jig Street, it leads you to an unexpected discovery: ",
                    "A doorbell, cleverly hacked. Now, every time the doorbell is activated through the net, it emits three distinct meows instead of its usual chime.",
                    "ㅤ",
                    "Faced with this quirky situation, you ponder your next move:",
                    "Choice 1: This doesn't seem like a promising lead. Better to try your luck elsewhere.",
                    "Choice 2: Curiosity gets the better of you. Why not ring the bell and see what unfolds?",
                    "Choice 3: Decide to undo the hack on the doorbell, restoring it to normal, and then move on to explore another trace."
                ],
                "size20": [
                    "",
                    ""
                ],
                "darkmode": [
                    "dm"
                ],
                "japanese": [
                    "jp"
                ]
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "伶ちゃん, こっちに来て",
                "alt": "Afterall, you are looking for a netrunner and not for some \n casual NC resident.",
                "routeToID": "0"
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "You cant help but wonder, is somebody actually at home?",
                "routeToID": "012"
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "You could do some good in the neighborhood for once, no?",
                "routeToID": "0"
            }
        }
    },
    "012": {
        "path": "",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "You choose to activate the bell, and three distinct meows emanate from the doorbell. After a brief wait, a voice from the communications module announces, '猫ちゃん、ちょっと待ってね' ",
                    "The door swings open, revealing a lady holding a plate of food. She looks around, puzzled by the absence of a cat, and calls out softly, '伶ちゃん, こっちに来て'",
                    "Seizing the opportunity, you decide to engage the lady in conversation. You explain that her doorbell has been tampered with, producing meows instead of its regular sound. Curious, you inquire if she knows anything about this or the identity of the cat.",
                    "Switching to English, she shares that she was unaware of the hack, always expecting to see a cat upon hearing the meows. She then reveals that the cat she thought she was calling, adorned with a collar from an in-town storage space rental, sometimes comes here for food. Now, she stands with a plate of yakitori, unsure what to do with it.",
                    "ㅤ",
                    "In this peculiar turn of events, you contemplate your next move:",
                    "Choice 1: Investigate yakitori online, as it seems to be the cat's preferred food.",
                    "Choice 2: Head to the storage space rental to uncover a new lead.",
                    "Choice 3: Conclude that this information isn't valuable and return to your search elsewhere.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Check Yakitori.",
                "screenreader": "",
                "alt": "Why specifically Yakitori?",
                "routeToID": "0211"
            },
            "second": {
                "visual": "Got to storage space rental.",
                "screenreader": "",
                "alt": "Why would a storage space rental own a cat? \nThere are barely any animals alive in this city anymore.",
                "routeToID": "02112"
            },
            "third": {
                "visual": "Leave the area.",
                "screenreader": "",
                "alt": "You have a hard time to make sence of all this information. \nYou decide to rather go check on the other leads.",
                "routeToID": "0"
            }
        }
    },
    "02": {
        "path": "this is the Start",
        "text": {
            "visual": {
                "size12": [
                    "",
                    ""
                ],
                "size16": [
                    "You decided to go check on the lead to Japantown. In the Bazaar area of Japantown you can pinpoint a signal from a CCTV camera that keeps a constant watch over a foodvendors store.",
                    "You also spot a self-service vending machine of the man's store that is connected to this signal. Upon closer inspection, you realize the machine has been hacked, programmed to dispense free food at the whim of an unseen hacker.",
                    "ㅤ",
                    "Although your options seem limited, there are a few actions you could take:",
                    "Choice 1: You could scrutinize the machines databank for free dispensed food.",
                    "Choice 2: You could undo the hack and follow another lead.",
                    "Choice 3: You could abuse the hack and dispense food for free"
                ],
                "size20": [
                    "",
                    ""
                ],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Scrutinize databank.",
                "screenreader": "",
                "alt": "",
                "routeToID": "021"
            },
            "second": {
                "visual": "Undo the hack.",
                "screenreader": "",
                "alt": "",
                "routeToID": "0"
            },
            "third": {
                "visual": "Dispense free food.",
                "screenreader": "",
                "alt": "",
                "routeToID": "023"
            }
        }
    },
    "021": {
        "path": "Scrutinize databank",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "After choosing to examine the databank, you delve into the records of the free food dispensed by the hacked machine. The data reveals a peculiar pattern: only three types of food have been frequently dispensed:",
                    "Yakitori, Miso Soup, and, intriguingly, a single Onigiri.",
                    "ㅤ",
                    "You decide to check find more information about these foods on the net:",
                    "Choice 1: Check the net for Yakitori",
                    "Choice 2: Check the net for Miso Soup",
                    "choice 3: Check the net for Onigiri"
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Yakitori",
                "screenreader": "You remember Yakitori to be the favourit food of your partner. Check on Yakitori",
                "alt": "This yakitori seems to be real meat.",
                "routeToID": "0211"
            },
            "second": {
                "visual": "Miso",
                "screenreader": "Miso soup. Your favourite starter. Check on Miso soup.",
                "alt": "You would love to have some Miso soup aswell now.",
                "routeToID": "0212"
            },
            "third": {
                "visual": "Onigiri",
                "screenreader": "You feel like you have seen Onigiri before today. Check on Onigiri",
                "alt": "You realize you have never ate onigiri before.",
                "routeToID": "0213"
            }
        }
    },
    "0211": {
        "path": "Jakitori",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "You decide to check on Yakitori. Next to some regular entries you finde 2 NCPD reports and a forum entry in the net:",
                    "ㅤ",
                    "NCPD Crime Report: Missing Yakitori Deliveries:",
                    "'Citywide alert: Several yakitori delivery vehicles have reported missing containers after making unscheduled stops. The NCPD is investigating these thefts.NCPD deems it low priority amid more pressing city issues.'",
                    "NCPD Crime Report: Santo Domingo Yakitori Odor",
                    "'Residents of Santo Domingo report persistent yakitori smell emanating from a local warehouse. NCPD deems it low priority amid more pressing city issues.'",
                    "Forum Post: Free Food Initiative",
                    "'Attention strays and homeless: Free food available, follow this ping for the location. Stay fed, stay strong!' - Posted by u/化け猫 伶'",
                    "ㅤ",
                    "Based on these insights, you now face a decision on which lead to pursue:",
                    "Choice 1: Investigate the pattern of stolen Yakitori deliveries to try and pinpoint where these thefts are occurring.",
                    "Choice 2: Explore the warehouse in Santo Domingo, seeking the source of the reported yakitori smell.",
                    "Choice 2: Respond to the forum post's ping, potentially leading you directly to the person or group behind these events.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Investigate the pattern of stolen Yakitori",
                "screenreader": "",
                "alt": "",
                "routeToID": "02111"
            },
            "second": {
                "visual": "Explore the warehouse",
                "screenreader": "",
                "alt": "",
                "routeToID": "02112"
            },
            "third": {
                "visual": "Respond to the forum post's ping",
                "screenreader": "",
                "alt": "",
                "routeToID": "02113"
            }
        }
    },
    "02111": {
        "path": "Investigate the pattern of stolen Yakitori",
        "text": {
            "visual": {
                "size12": [
                    "After deciding to delve deeper into the mystery of the stolen Yakitori deliveries, you gain access to detailed reports, revealing a curious pattern: each vehicle made an unscheduled stop in Santo Domingo, alarmingly close to the previously noted warehouse. Intrigued, you seamlessly navigate the area's CCTV network, honing in on the warehouse in question. There, you witness a food transport being methodically unloaded by a service mech and it is certainly directly controlled by a netrunner.",
                    "A more thorough scan of the surrounding CCTV feeds unveils an unexpected sight: several cats gathered inside the warehouse, feasting on Yakitori. The pieces of the puzzle begin to align, leading you to the conclusion that you've located the rogue netrunner, 化け猫 伶, caught in the act of hijacking another delivery.",
                    "This revelation presents a pivotal opportunity to influence the fate of your partner. With precision, you hack into the service bot to establish a direct link to the elusive netrunner 化け猫 伶.",
                    "ㅤ",
                    "Faced with this crucial moment, you weigh your options:",
                    "Choice 1: Initiate a shutdown of 化け猫 伶, aiming to trap him within the same digital confines that currently ensnare your partner. Maybe by shutting down the netrunner the grip it has on your partner will loosen.",
                    "Choice 2: Reflecting on the scene before you, you recognize the humanitarian aspect of 化け猫 伶 actions. Decide to step back, you partner seems to be involved in this and maybe you should respect what is going on here.",
                    "Choice 3: Choose to disrupt 化け猫 伶 current activity, seizing this chance to directly confront the netrunner. Given the good he does, he might be willing to let you partner go.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size16": [
                    "After deciding to delve deeper into the mystery of the stolen Yakitori deliveries, you gain access to detailed reports, revealing a curious pattern: each vehicle made an unscheduled stop in Santo Domingo, alarmingly close to the previously noted warehouse. Intrigued, you seamlessly navigate the area's CCTV network, honing in on the warehouse in question. There, you witness a food transport being methodically unloaded by a service mech.",
                    "A more thorough scan of the surrounding CCTV feeds unveils an unexpected sight: several cats gathered inside the warehouse, feasting on Yakitori. The pieces of the puzzle begin to align, leading you to the conclusion that you've located the rogue netrunner, 化け猫 伶, caught in the act of hijacking another delivery.",
                    "This revelation presents a pivotal opportunity to influence the fate of your partner. With precision, you hack into the service bot to establish a direct link to the elusive netrunner 化け猫 伶.",
                    "ㅤ",
                    "Faced with this crucial moment, you weigh your options:",
                    "Choice 1: Initiate a shutdown of 化け猫 伶, aiming to trap him within the same digital confines that currently ensnare your partner.",
                    "Choice 2: Reflecting on the scene before you, you recognize the humanitarian aspect of 化け猫 伶 actions. Decide to step back, allowing the operation to continue.",
                    "Choice 3: Choose to disrupt 化け猫 伶 current activity, seizing this chance to directly confront the netrunner.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Initiate a shutdown of Rei",
                "screenreader": "Initiate a shutdown of the rogue netrunner, aiming to trap him within the same digital confines that currently ensnare your partner. You are not sure however if this will bring more harm then good to anyone involved",
                "alt": "You hope this bold move will reverse the hack \nand liberate your partner.",
                "routeToID": "0211A1"
            },
            "second": {
                "visual": "Decide to step back",
                "screenreader": "Feeding the homeless and strays of Night City, though illegal, is a charitable act. With this in mind, you decide to step back, allowing the operation to continue but you might loose this opportunity to free your partner.",
                "alt": "It seems there is more going on than you can comprehend right now. \nMaybe its best to step back and wait.",
                "routeToID": "0211A2"
            },
            "third": {
                "visual": "confront the netrunner",
                "screenreader": "Choose to disrupt the rogue netrunner's current activity, Getting a chance to talk to it might be get you the best outcome for everyone involved.",
                "alt": "You risk getting caught by 化け猫 伶 and get traped yourself. \nYou might loose this oportunity to end all of this before it is too late.",
                "routeToID": "0211A3"
            }
        }
    },
    "02112": {
        "path": "Explore the warehouse",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "You directly target the warehouse, slicing through digital barriers to access its CCTV network.",
                    "A more thorough scan of the surrounding CCTV feeds unveils an unexpected sight: several cats gathered inside the warehouse, feasting on Yakitori. The pieces of the puzzle begin to align, leading you to the conclusion that you've located the rogue netrunner, 化け猫 伶, caught in the act of hijacking another delivery.",
                    "This revelation presents a pivotal opportunity to influence the fate of your partner. With precision, you hack into the service bot to establish a direct link to the elusive netrunner 化け猫 伶.",
                    "ㅤ",
                    "Faced with this crucial moment, you weigh your options:",
                    "Choice 1: Initiate a shutdown of 化け猫 伶, aiming to trap him within the same digital confines that currently ensnare your partner.",
                    "Choice 2: Reflecting on the scene before you, you recognize the humanitarian aspect of 化け猫 伶 actions. Decide to step back, allowing the operation to continue.",
                    "Choice 3: Choose to disrupt 化け猫 伶 current activity, seizing this chance to directly confront the netrunner.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "confront the netrunner",
                "screenreader": "Initiate a shutdown of the rogue netrunner, aiming to trap him within the same digital confines that currently ensnare your partner. You are not sure however if this will bring more harm then good to anyone involved",
                "alt": "You hope this bold move will reverse the hack \nand liberate your partner.",
                "routeToID": "0211A1"
            },
            "second": {
                "visual": "confront the netrunner",
                "screenreader": "Feeding the homeless and strays of Night City, though illegal, is a charitable act. With this in mind, you decide to step back, allowing the operation to continue but you might loose this opportunity to free your partner.",
                "alt": "It seems there is more going on than you can comprehend right now. \nMaybe its best to step back and wait.",
                "routeToID": "0211A2"
            },
            "third": {
                "visual": "confront the netrunner",
                "screenreader": "Choose to disrupt the rogue netrunner's current activity, Getting a chance to talk to it might be get you the best outcome for everyone involved.",
                "alt": "You risk getting caught by 化け猫 伶 and get traped yourself. \nYou might loose this oportunity to end all of this before it is too late.",
                "routeToID": "0211A3"
            }
        }
    },
    "02113": {
        "path": "Respond to the forum post's ping",
        "text": {
            "visual": {
                "size12": [
                    "Guided by the mysterious ping through the net, your journey takes you on a digital chase across Santo Domingos CCTV. Each camera you access is looking at a cat paw spray-paint, a breadcrumb trail left by Rei. This clever path of paws leads you, camera by camera, straight to the warehouse, the location you were meant to find from the forum post by 化け猫 伶. ",
                    "A more thorough scan of the surrounding CCTV feeds unveils an unexpected sight: several cats gathered inside the warehouse, feasting on Yakitori. The pieces of the puzzle begin to align, leading you to the conclusion that you've located the rogue netrunner, Rei, caught in the act of hijacking another delivery.",
                    "This revelation presents a pivotal opportunity to influence the fate of your partner. With precision, you hack into the service bot to establish a direct link to the elusive netrunner 化け猫 伶.",
                    "ㅤ",
                    "Faced with this crucial moment, you weigh your options:",
                    "Choice 1: Initiate a shutdown of 化け猫 伶, aiming to trap him within the same digital confines that currently ensnare your partner. Maybe by shutting down the netrunner the grip it has on your partner will loosen up.",
                    "Choice 2: Reflecting on the scene before you, you recognize the humanitarian aspect of 化け猫 伶 actions. Decide to step back, you partner seems to be involved in this and maybe you should respect what is going on here.",
                    "Choice 3: Choose to disrupt 化け猫 伶 current activity, seizing this chance to directly confront the netrunner. Given the good he does, he might be willing to let you partner go.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size16": [
                    "Guided by the mysterious ping through the net, your journey takes you on a digital chase across Santo Domingos CCTV. Each camera you access is looking at a cat paw spray-paint, a breadcrumb trail left by Rei. This clever path of paws leads you, camera by camera, straight to the warehouse, the location you were meant to find from the forum post by 化け猫 伶. ",
                    "A more thorough scan of the surrounding CCTV feeds unveils an unexpected sight: several cats gathered inside the warehouse, feasting on Yakitori. The pieces of the puzzle begin to align, leading you to the conclusion that you've located the rogue netrunner, Rei, caught in the act of hijacking another delivery.",
                    "This revelation presents a pivotal opportunity to influence the fate of your partner. With precision, you hack into the service bot to establish a direct link to the elusive netrunner 化け猫 伶.",
                    "ㅤ",
                    "Faced with this crucial moment, you weigh your options:",
                    "Choice 1: Initiate a shutdown of 化け猫 伶, aiming to trap him within the same digital confines that currently ensnare your partner.",
                    "Choice 2: Reflecting on the scene before you, you recognize the humanitarian aspect of 化け猫 伶 actions. Decide to step back, allowing the operation to continue.",
                    "Choice 3: Choose to disrupt 化け猫 伶 current activity, seizing this chance to directly confront the netrunner.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Initiate a shutdown of Rei",
                "screenreader": "Initiate a shutdown of the rogue netrunner, aiming to trap him within the same digital confines that currently ensnare your partner. You are not sure however if this will bring more harm then good to anyone involved",
                "alt": "You hope this bold move will reverse the hack \nand liberate your partner.",
                "routeToID": "0211A1"
            },
            "second": {
                "visual": "Decide to step back",
                "screenreader": "Feeding the homeless and strays of Night City, though illegal, is a charitable act. With this in mind, you decide to step back, allowing the operation to continue but you might loose this opportunity to free your partner.",
                "alt": "It seems there is more going on than you can comprehend right now. \nMaybe its best to step back and wait.",
                "routeToID": "0211A2"
            },
            "third": {
                "visual": "confront the netrunner",
                "screenreader": "Choose to disrupt the rogue netrunner's current activity, Getting a chance to talk to it might be get you the best outcome for everyone involved.",
                "alt": "You risk getting caught by 化け猫 伶 and get traped yourself. \nYou might loose this oportunity to end all of this before it is too late.",
                "routeToID": "0211A3"
            }
        }
    },
    "0212": {
        "path": "Miso",
        "text": {
            "visual": {
                "size12": [],
                "size16": [],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Yakitori",
                "screenreader": "You remember Yakitori to be the favourit food of your partner. Check on Yakitori",
                "alt": "This yakitori seems to be real meat.",
                "routeToID": "0211"
            },
            "second": {
                "visual": "Go Back",
                "screenreader": "",
                "alt": "You have wasted enough time anyway.",
                "routeToID": "02"
            },
            "third": {
                "visual": "Onigiri",
                "screenreader": "You feel like you have seen Onigiri before today. Check on Onigiri",
                "alt": "You realize you have never ate onigiri before.",
                "routeToID": "0213"
            }
        }
    },
    "0213": {
        "path": "Onigiri",
        "text": {
            "visual": {
                "size12": [
                    "You found some historical facts about Onigiri:",
                    "'Onigiri (お握り or 御握り), also known as omusubi (お結び), nigirimeshi (握り飯), or rice ball, is a Japanese food made from white rice formed into triangular or cylindrical shapes and often wrapped in nori.[a] Traditionally, an onigiri is filled with pickled ume (umeboshi), salted salmon, katsuobushi, kombu, tarako, mentaiko, takanazuke (pickled takana, Japanese giant red mustard greens) or any other salty or sour ingredient as a natural preservative. Because it is easily portable and eaten by hand, onigiri has been used as portable food or bento from ancient times to the present day'",
                    "ㅤ",
                    "Maybe its better to follow a different trace:",
                    "Choice 1: Look up Yakitori instead.",
                    "Choice 2: Look up Miso Soup instead.",
                    "Choice 3: Forget about the foods and go back to the Machine"
                ],
                "size16": [
                    "All that you find on Onigiri online are rezipies and some historical information.",
                    "ㅤ",
                    "Maybe its better to follow a different trace:",
                    "Choice 1: Look up Yakitori instead.",
                    "Choice 2: Look up Miso Soup instead.",
                    "Choice 3: Forget about the foods and go back to the Machine"
                ],
                "size20": [
                    "You found good recipie for Onigiri:",
                    "For the Steamed Rice:",
                    "2¼ cups uncooked Japanese short-grain white rice (3 rice cooker cups; 540 ml) \n2½ cups water (600 ml)",
                    "For the Onigiri:",
                    "Diamond Crystal kosher salt, \n3 sheets nori (dried laver seaweed)",
                    "...",
                    "ㅤ",
                    "Maybe its better to follow a different trace:",
                    "Choice 1: Look up Yakitori instead.",
                    "Choice 2: Look up Miso Soup instead.",
                    "Choice 3: Forget about the foods and go back to the Machine"
                ],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Yakitori",
                "screenreader": "You remember Yakitori to be the favourit food of your partner. Check on Yakitori",
                "alt": "This yakitori seems to be real meat.",
                "routeToID": "0211"
            },
            "second": {
                "visual": "Miso",
                "screenreader": "Miso soup. Your favourite starter. Check on Miso soup.",
                "alt": "You would love to have some Miso soup aswell now.",
                "routeToID": "0212"
            },
            "third": {
                "visual": "Go Back",
                "screenreader": "",
                "alt": "You have wasted enough time anyway.",
                "routeToID": "02"
            }
        }
    },
    "023": {
        "path": "Blank to copy!",
        "text": {
            "visual": {
                "size12": [
                    "Which food would your like to dispense?",
                    "ㅤ",
                    "Choice 1: Dispense Yakitori. But wait for noone to watch the machine.",
                    "Choice 2: Dispense Miso Soup. But wait for noone to watch the machine.",
                    "Choice 3: Dispense Onigiri. But wait for noone to watch the machine."
                ],
                "size16": [
                    "Which food would your like to dispense?",
                    "ㅤ",
                    "Choice 1: Dispense Yakitori",
                    "Choice 2: Dispense Miso Soup",
                    "Choice 3: Dispense Onigiri"
                ],
                "size20": [
                    "Which food would your like to dispense?",
                    "ㅤ",
                    "Choice 1: Dispense 10x Yakitori",
                    "Choice 2: Dispense 10x Miso Soup",
                    "Choice 3: Dispense 25x Onigiri. Can't ever have enough, right?"
                ],
                "darkmode": [
                    "Which food would your like to make free forever?",
                    "ㅤ",
                    "Choice 1: Hack Yakitori.",
                    "Choice 2: Hack Miso Soup",
                    "Choice 3: Hack Onigiri"
                ],
                "darkmodeJap": [
                    "test"
                ],
                "japanese": [
                    "test 1"
                ]
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "Dispense Yakitori",
                "alt": "Dispense Yakitori",
                "routeToID": ""
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "Dispense Miso Soup",
                "alt": "Dispense Miso Soup",
                "routeToID": ""
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "Dispense Onigiri",
                "alt": "Dispense Onigiri",
                "routeToID": ""
            }
        }
    },
    "0231": {
        "path": "Dispense Yakitori",
        "text": {
            "visual": {
                "size12": [],
                "size16": [],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            }
        }
    },
    "0232": {
        "path": "Blank to copy!",
        "text": {
            "visual": {
                "size12": [],
                "size16": [],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            }
        }
    },
    "0233": {
        "path": "Blank to copy!",
        "text": {
            "visual": {
                "size12": [],
                "size16": [],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            }
        }
    },
    "03": {
        "path": "this is the Start",
        "text": {
            "visual": {
                "size12": [
                    "The trace leads you into the Megabuilding H1's internal security channels. To be exact there is just one CCTV camera in the Garage that was shortcut by the rogue netrunner.",
                    "ㅤ",
                    "The cameras focus is on a transport vehicle that can be remotely accessed. This vehicle is familiar to you. There is a very speciffic sticker on its windshield that resembels a paw. You could try to get more infromation by accessing it but it could be anyones vehicle:",
                    "Choice 1: Opt to breach the vehicle's system to probe its onboard sensors. Investigating the internal storage might reveal contraband, clues, or perhaps something more personal belonging to the owner",
                    "Choice 2: Dive into the vehicle's navigation history. Understanding where the vehicle has traveled could map out a new lead.",
                    "Choice 3: The connection to the netrunner seems tenuous at best through this lead. It might be wiser to redirect your efforts towards investigating the other potential locations linked to the Bakeneko's digital trail.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size16": [
                    "The trace leads you into the Megabuilding H1's internal security channels. To be exact there is just one CCTV camera in the Garage that was shortcut by the rogue netrunner.",
                    "ㅤ",
                    "The cameras focus is on a transport vehicle that can be remotely accessed. You could try to get more infromation by accessing it but it could be anyones vehicle:",
                    "Choice 1: Opt to breach the vehicle's system to probe its onboard sensors getting a glimps of what it might transport.",
                    "Choice 2: Dive into the vehicle's navigation history.",
                    "Choice 3: It might be wiser to redirect your efforts towards investigating the other potential locations.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [
                    "",
                    ""
                ],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Access storage room",
                "screenreader": "",
                "alt": "",
                "routeToID": "031"
            },
            "second": {
                "visual": "Get gps data",
                "screenreader": "",
                "alt": "",
                "routeToID": "032"
            },
            "third": {
                "visual": "go back",
                "screenreader": "",
                "alt": "",
                "routeToID": "0"
            }
        }
    },
    "031": {
        "path": "Access storage room",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "Upon accessing the vehicle's internal storage, you find it laden with boxes of frozen Yakitori. The discovery is puzzling; the link between the netrunner and these boxes of Yakitori isn't immediately apparent.",
                    "ㅤ",
                    "With this unexpected find, you pause to contemplate your next move:",
                    "",
                    "Choice 2: Dive into the vehicle's navigation history aswell.",
                    "Choice 3: The connection seems tenuous, and you begin to question the relevance of this lead. You go back and try another lead.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Yakitori",
                "screenreader": "You remember Yakitori to be the favourit food of your partner. Check on Yakitori",
                "alt": "This yakitori seems to be real meat.",
                "routeToID": "0211"
            },
            "second": {
                "visual": "Get gps data",
                "screenreader": "",
                "alt": "",
                "routeToID": "032"
            },
            "third": {
                "visual": "go back",
                "screenreader": "",
                "alt": "",
                "routeToID": "0"
            }
        }
    },
    "032": {
        "path": "Get gps data",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "Diving into the vehicle's navigation history, you uncover a pattern that piques your interest. A specific route has been frequented multiple times: it stretches from underneath the bustling bazaar in Japantown to an old warehouse in Santo Domingo.",
                    "You chould check out these locations, hoping you might find more there, or try to get more information from the vehicle.",
                    "ㅤ",
                    "You decide to:",
                    "Choice 1: You decide to investigate the Japantown bazaar area further.",
                    "Choice 2: The warehouse in Santo Domingo beckons as your next destination.",
                    "Choice 3: Before moving on, you choose to get more infromation of the vehicle's load.",
                    "ㅤ",
                    "ㅤ"
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Japantown bazaar",
                "screenreader": "",
                "alt": "Japantown Bazarr? \nAnother trace left there before. \nThere might be more information!",
                "routeToID": "02"
            },
            "second": {
                "visual": "Explore the warehouse",
                "screenreader": "",
                "alt": "",
                "routeToID": "02112"
            },
            "third": {
                "visual": "Check vehicle load",
                "screenreader": "",
                "alt": "",
                "routeToID": "031"
            }
        }
    },
    "FINAL": "FINAL",
    "FIN": "FINAL",
    "FINALY": "FINAL",
    "0211A1": {
        "path": "Initiate a shutdown of Rei",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "Determined to end the digital tyranny of the rogue netrunner, you launch a decisive hack to shut him down, mirroring the digital cage that ensnared your partner. Success washes over you as you disconnect from the net, but the victory is short-lived.",
                    "Your partner remains trapped, unresponsive to the world around him, a soul caught in the limbo between realms. You hoped it would loosen the grip. The silence that follows is heavy with disappointment.",
                    "With no discernible improvement in his condition, the path forward narrows to one option: seeking out specialists who can navigate this complex intersection of realities and perhaps undo the entanglement that binds him."
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            },
            "second": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            },
            "third": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            }
        }
    },
    "0211A2": {
        "path": "Decide to step back",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "Opting for restraint, you step away from the immediate tension of the warehouse scene. The charitable nature of Rei's digital thefts, providing for the city's forgotten, casts a complex shadow over your mission. Disconnecting from the net, you're left to ponder the connection between Rei's actions and your partner's plight.",
                    "Days later, driven by an inexplicable urge, you visit the warehouse in person, only to find the service mech powering down at your approach. The moment is shrouded in confusion until it gives way to happines in the form of a message from your partner, inviting you  to the bazaar in Japantown for dinner. Relief washes over you as you realize he's been released, a silent end to his digital captivity."
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            },
            "second": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            },
            "third": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            }
        }
    },
    "0211A3": {
        "path": "confront the netrunner",
        "text": {
            "visual": {
                "size12": [],
                "size16": [
                    "Faced with 化け猫 伶, you assert the unintended consequences of his actions on your partner. The revelation takes Rei by surprise, and a moment of digital introspection follows. He confesses that freeing your partner would require his own termination—a sacrifice he's prepared to make, highlighting his never-intended harm.",
                    "He begs you to continue this work and he will let your partner free.",
                    "As 化け猫 伶 digital essence dissolves, you disconnect, returning to a world where your partner slowly emerges from his digital stupor. Disoriented, he awakens with no memory of the recent events, the warehouse, or 化け猫 伶 noble sacrifice. The ordeal has left no scars on his consciousness, only a quiet gratitude for the mysterious resolution that brought him back to you.",
                    ""
                ],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            },
            "second": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            },
            "third": {
                "visual": "Play again",
                "screenreader": "This has been the final. Do you want to play again?",
                "alt": "Play again",
                "routeToID": "0"
            }
        }
    },
    "0211B1": {
        "path": "Blank to copy!",
        "text": {
            "visual": {
                "size12": [],
                "size16": [],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            }
        }
    },
    "0211B2": {
        "path": "Blank to copy!",
        "text": {
            "visual": {
                "size12": [],
                "size16": [],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            }
        }
    },
    "0211B3": {
        "path": "Blank to copy!",
        "text": {
            "visual": {
                "size12": [],
                "size16": [],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            }
        }
    },
    "BLANK": "BLANK",
    "0x": {
        "path": "Blank to copy!",
        "text": {
            "visual": {
                "size12": [],
                "size16": [],
                "size20": [],
                "darkmode": [],
                "darkmodeJap": [],
                "japanese": []
            },
            "screenreader": "",
            "alt": ""
        },
        "choices": {
            "first": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "second": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            },
            "third": {
                "visual": "ㅤ",
                "screenreader": "",
                "alt": "",
                "routeToID": ""
            }
        }
    }
}